ИнКар.Маркетплейсы/src/InformationRegisters/УдалитьМП_АвитоИдентификаторыОбъявлений/УдалитьМП_АвитоИдентификаторыОбъявлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УдалитьМП_АвитоИдентификаторыОбъявлений</name>
  <resources>
    <name>НазваниеОбъявления</name>
    <comment>&lt;Title>Бампер передний Audi A4 MW0218681&lt;/Title></comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <comment>&lt;DateBegin>2015-12-24&lt;/DateBegin></comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <comment>&lt;DateEnd>2079-08-28&lt;/DateEnd></comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВариантПлатногоРазмещения</name>
    <comment>&lt;ListingFee>PackageSingle&lt;/ListingFee></comment>
    <type>
      <types>EnumRef.МП_АвитоВариантыПлатногоРазмещения</types>
    </type>
  </resources>
  <resources>
    <name>ПлатнаяУслуга</name>
    <comment>&lt;AdStatus>x10_7&lt;/AdStatus></comment>
    <type>
      <types>CatalogRef.МП_АвитоПлатныеУслуги</types>
    </type>
  </resources>
  <resources>
    <name>ВозможностьНаписатьСообщениеПоОбъявлениюЧерезСайт</name>
    <comment>&lt;AllowEmail>Нет&lt;/AllowEmail></comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Менеджер</name>
    <comment>&lt;ManagerName>Иван Петров-Водкин&lt;/ManagerName></comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>НомерТелефона</name>
    <comment>&lt;ContactPhone>+7 495 777-10-66&lt;/ContactPhone></comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Адрес</name>
    <comment>&lt;Address>Россия, Тамбовская область, Моршанск, Лесная улица, 7&lt;/Address></comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КатегорияОбъявления</name>
    <comment>&lt;Category>Запчасти и аксессуары&lt;/Category></comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПодкатегорияТовара</name>
    <comment>&lt;TypeId>16-814&lt;/TypeId></comment>
    <type>
      <types>CatalogRef.МП_АвитоПодкатегорииТоваров</types>
    </type>
  </resources>
  <resources>
    <name>ВидОбъявления</name>
    <comment>&lt;AdType>Товар от производителя&lt;/AdType></comment>
    <type>
      <types>EnumRef.МП_АвитоВидыОбъявлений</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <comment>&lt;Condition>Новое&lt;/Condition></comment>
    <type>
      <types>EnumRef.МП_АвитоСостояние</types>
    </type>
  </resources>
  <resources>
    <name>Доступность</name>
    <comment>&lt;Availability>Под заказ&lt;/Availability></comment>
    <type>
      <types>EnumRef.МП_АвитоДоступность</types>
    </type>
  </resources>
  <resources>
    <name>OEM</name>
    <comment>&lt;OEM>84501SC020&lt;/OEM></comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусОбъявления</name>
    <comment>Статус объявления на сайте (можно указать несколько значений через запятую)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>URLАдресОбъявления</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусРазмещенияНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбщийСтатусОбработкиОбъявления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусПредварительнойОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеПубликоватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Профиль</name>
    <type>
      <types>CatalogRef.МП_Профили</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторАвито</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>АйДи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИнКар.Маркетплейсы/src/InformationRegisters/УдалитьМП_АвитоИдентификаторыОбъявлений/RecordSetModule.bsl
//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Для Каждого Элемент Из ЭтотОбъект Цикл

		МП_АвитоВызовСервера.ЗаполнитьНазваниеОбъявления(Элемент);
		ЗаполнитьИдентификаторОбъявления(Элемент);

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьИдентификаторОбъявления(Элемент)

	Профиль = ?(Элемент.Профиль.Пустая(), "БезПрофиля", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент.Профиль,
																								  "Код"));
	Номенклатура = ?(Элемент.Номенклатура.Пустая(),
					 "БезНоменклатуры",
					 ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент.Номенклатура, "Код"));
	Характеристика = ?(Элемент.Характеристика.Пустая(),
					   "БезХарактеристики",
					   ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент.Характеристика, "Наименование"));
	Идентификатор = СтрШаблон("%1$%2$%3", Профиль, Номенклатура, Характеристика);

	Элемент.Идентификатор = Идентификатор;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
